<?php
/*
Класс в php тип данных, который вы моете сами создавать
Объект - экземпляр класса

Класс -как чертёж для плотника
Объект - конкретный стол

 * */

/*
КЛАСС
- Класс - тип данных
- Он описывает, какими будут объекты этого класса
- Класс - это "идея" объектов

ОБЪЕКТ
- Объект - это экземпляр класса, реализация идеи, заложеной в классе
- Его структура и поведение определяются классом, которому принадлежит объект
 * */

/*
В классе и объектах могут быть определены свойста и методы

СВОЙСТВА
- Поля или свойства - переменные, определенные в классе
- Каждый объект этого класса получает эти переменные
- Они отвечают за свойства объектов:
    число ножек стола
    материал
    цвет и.т.д.

МЕТОДЫ
- Методы - это функции, определенные в классе
- Они отвечают за поведение объектов класса
- Или за операции, которые можно проводить над объектами
    передвинуть
    накрыть скатертью
    посчитать количество человек за столом


*/
/*
Класс может содержать сколько угодно свойств,
они могут быть любого типа:
- строками
- числами
- массивами
- другими объектами

 * */

/*
 Ключевые слова
new содание объекта данного класса
$this->свойство  доступ к свойствам данного класса изнутри объекта
не обязательно устанавливать у объекта все прописанные в классе свойства
 * */